Dim i, s As Integer

Public Sub main()
'Приклад 1: знайти суму цілих чисел від 1 до 100
s = 0 'сума = 0
i = 1 'перше число
Do 'виконувати цикл
s = s + i 'додати до суми 'i'
i = i + 1 'наступне 'i'
Loop While i <= 100 'повторювати, поки 'i' менше рівне 100
Debug.Print s 'вивести суму

'Приклад 2: знайти суму цілих чисел від 1 до 100
s = 0 'сума = 0
i = 1 'перше число
Do While i<=100 'виконувати цикл, поки 'i' менше рівне 100
s = s + i 'додати до суми 'i'
i = i + 1 'наступне 'i'
Loop  'повторити
Debug.Print s 'вивести суму
End Sub
