Dim i, s As Integer
Dim x, y As Double
Dim obj As Object

Public Sub main()
'Приклад 1: знайти суму цілих чисел від 1 до 100
s = 0 'присвоїти сумі 0
For i = 1 To 100 'i змінюється від 1 до 100
    s = s + i 'додати до суми 'i'
Next i 'наступне 'i'
Debug.Print s 'вивести

'Приклад 2: вивести таблицю значень y=Sin(x), якщо 'x' змінюється від 0 до 1 з кроком 0.1
For x = 0 To 1 Step 0.1 'x змінюється від 0 до 1 з кроком 0.1
    y = Sin(x) 'обчислення функції
    Debug.Print "x="; x; "y="; y 'вивести
Next x 'наступне 'x'

'Приклад 3: знайти індекс елемента масиву зі значенням 7
A = Array(2, 5, 7, 1) 'масив
For i = 0 To 3 'i змінюється від 0 до 3
    'якщо елемент рівний 7, то вивести індекс і вийти з циклу
    If A(i) = 7 Then Debug.Print i: Exit For
Next i 'наступне 'i'

'Приклад 4: вивести елементи масиву А
For Each x In A 'для кожного х у А
    Debug.Print x; 'вивести
Next x 'наступний х

'Приклад 5: вивести в комірки A1:A5 1
For Each obj In Range("A1:A5") 'для кожного об'єкта obj у діапазоні комірок
    obj.Value = 1 'присвоїти значенню комірки 1
Next obj 'наступний об'єкт
End Sub
