Dim x, y As Double
Dim i As Integer

Public Sub main()
x = 0.5
y = Abs(x) 'модуль
y = Atn(x) 'арктангенс
y = Cos(x) 'косинус кута в радіанах
y = Exp(x) 'експонента (приблизно 2.71^x)
y = Log(x) 'натуральний логарифм
y = Rnd(x) 'випадкове число від 0 до 1
y = Sgn(x) 'повертає 0, 1, -1 в залежності від знаку 'x'
y = Sin(x) 'синус кута в радіанах
y = Sqr(x) 'корінь квадратний
y = Tan(x) 'тангенс кута в радіанах
i = Fix(x) 'повертає найближче найменше ціле для додатного числа і найближче найбільше ціле для від'ємного
i = Int(x) 'повертає найближче найменше ціле
'похідні математичні функції
y = 1 / Tan(x) 'котангенс
y = Atn(x / Sqr(-x * x + 1)) 'арксинус
y = Atn(-x / Sqr(-x * x + 1)) + 2 * Atn(1) 'арккосинус
y = Atn(x) + 2 * Atn(1) 'арккотангенс
y = Log(x) / Log(5) 'логарифм з основою 5
y = Int((9 - 5 + 1) * Rnd + 5) 'випадкове число від 5 до 9
End Sub
