Dim s1, s2 As String

Public Sub main()
c = Asc("Y") 'повертає ASCII код символу
s1 = Chr(89) 'повертає символ за ASCII кодом
'Chr(13) - символ переходу на новий рядок
Debug.Print "hello" & Chr(13) & "world"
s1 = "Hello World!!!"
s2 = Mid(s1, 1, 5) 'повертає підрядок, починаючи з 1-го символу, довжиною 5 символів, s2="Hello"
i = Len(s1) 'довжина рядка, i=14
s1 = " " & s2 & "  " 'додати до рядка символи пробілу
s2 = Trim(s) 'видаляє символи пробілу спочатку і вкінці рядка
i = InStr(s1, s2) 'повертає позицію першого входження s2 у s1, i=2
i = StrComp(s1, s2) 'порівнює рядки, i=1 (s1 > s2)
End Sub
